Repository: rafaella-vlase/SD_FlowerShop_MVC
Catalog: MVCFlowerShop/MVC_FlowerShop/Model/Language/string.*.resx
Languages: it

# buttonAdd
source: Add
it: Aggiungi

# buttonDelete
source: Delete
it: Elimina

# buttonLogout
source: Logout
it: Disconnetti

# buttonSaveCSV
source: Save CSV
it: Salva CSV

# buttonSaveDOC
source: Save DOC
it: Salva DOC

# buttonSaveJSON
source: Save JSON
it: Salva JSON

# buttonSaveXML
source: Save XML
it: Salva XML

# buttonSearch
source: Search
it: Cerca

# buttonStatistics
source: Statistics
it: Statistiche

# buttonUpdate
source: Update
it: Aggiorna

# buttonViewAll
source: View All
it: Vedi tutto

# labelChangeLanguage
source: Change Language
it: Cambia lingua

# labelColor
source: Color
it: Colore

# labelCriterion
source: Criterion
it: Criterio

# labelFilterBy
source: Filter By
it: Filtra per

# labelFlowerID
source: Flower ID
it: ID del fiore

# labelFlowerName
source: Flower Name
it: Nome del fiore

# labelFlowerShop
source: Flower Shop
it: Negozio di fiori

# labelOrderBy
source: Order By
it: Ordina per

# labelPassword
source: Password
it: Parola d'ordine

# labelPrice
source: Price
it: Prezzo

# labelRole
source: Role
it: Ruolo

# labelSearchFlower
source: Search Flower By Name
it: Cerca fiore per nome

# labelSearchRole
source: Search user by role
it: Cerca utente per ruolo

# labelSelectLanguage
source: Select Language:
it: Seleziona la lingua:

# labelShopID
source: Shop ID
it: Identificativo del negozio

# labelStock
source: Stock
it: Magazzino

# labelUserID
source: User ID
it: ID dell’utente

# labelUsername
source: Username
it: Nome utente

# messageBoxAddFail
source: Adding ended with failure!
it: L’aggiunta è fallita!

# messageBoxAddSuccess
source: Adding was successful!
it: L’aggiunta è stata un successo!

# messageBoxColorEmpty
source: Color is empty!
it: Il colore è vuoto!

# messageBoxDeleteFail
source: Deletion ended with failure!
it: L’eliminazione è fallita!

# messageBoxDeleteSuccess
source: Deleting was successful!
it: L’eliminazione è stata un successo!

# messageBoxFileSaveSuccess
source: File save successfully!
it: File salvato con successo!

# messageBoxFlowerIDNonZero
source: Flower ID must be non-zero natural number!
it: L’ID del fiore deve essere un numero naturale non zero!

# messageBoxFlowerNameEmpty
source: Flower Name is empty!
it: Il nome del fiore è vuoto!

# messageBoxNoData
source: There is no data in your table!
it: Non ci sono dati nella tua tabella!

# messageBoxNoFlowerAvailable
source: There is no flower available!
it: Non c’è un fiore disponibile!

# messageBoxNoFlowerDesiredName
source: There is no flower with desired name!
it: Non c’è un fiore con il nome desiderato!

# messageBoxNoFlowerSelected
source: No flower has been selected to be deleted!
it: Nessun fiore è stato selezionato per l’eliminazione!

# messageBoxNoUserDesiredRole
source: No user with desired role!
it: Nessun utente con il ruolo desiderato!

# messageBoxNoUserSelected
source: No user has been selected to be updated!
it: Nessun utente è stato selezionato per l’aggiornamento!

# messageBoxPasswordEmpty
source: Password is empty!
it: La password è vuota!

# messageBoxPriceHigher
source: Price should be higher than 0!
it: Il prezzo dovrebbe essere superiore a 0!

# messageBoxRoleEmpty
source: Role is empty!
it: Il ruolo è vuoto!

# messageBoxSearchEmpty
source: Search bar is empty!
it: La barra di ricerca è vuota!

# messageBoxShopIDNonZero
source: Shop ID must be non-zero natural number!
it: L’ID del negozio deve essere un numero naturale non zero!

# messageBoxStockMinZero
source: Stock should be at least 0!
it: Il magazzino dovrebbe essere almeno 0!

# messageBoxUpdateFail
source: Updating ended with failure!
it: L’aggiornamento è fallito!

# messageBoxUpdateSuccess
source: Updating was successful!
it: L’aggiornamento è stato un successo!

# messageBoxUserIDNonZero
source: User ID must be non-zero natural number!
it: L’ID dell’utente deve essere un numero naturale non zero!

# messageBoxUsernameEmpty
source: Username is empty!
it: Il nome utente è vuoto!
